DataProcessors/ЛБ_ИзменениеПредельныхЗначенийПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ИзменениеПредельныхЗначенийПроцентов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ПредельныеЗначенияПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПредельныеЗначенияПроцентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредельнаяВеличинаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельнаяСтавкаКредитованияГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ИзменениеПредельныхЗначенийПроцентов/Forms/ПредельныеЗначенияПроцентов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ПолучитьЗначенияНаДату();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначенияНаДату()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПредельныеЗначенияПроцентовСрезПоследних.ПредельнаяВеличинаПроцентов КАК ПредельнаяВеличинаПроцентов,
	               |	ЛБ_ПредельныеЗначенияПроцентовСрезПоследних.ПредельнаяСтавкаКредитованияГод КАК ПредельнаяСтавкаКредитованияГод
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПредельныеЗначенияПроцентов.СрезПоследних(&Дата, Организация = &Организация) КАК ЛБ_ПредельныеЗначенияПроцентовСрезПоследних";
	
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ПредельнаяВеличинаПроцентовНовая = Выборка.ПредельнаяВеличинаПроцентов;
		ПредельнаяСтавкаКредитованияГодНовая = Выборка.ПредельнаяСтавкаКредитованияГод;		
	Иначе                
		ПредельнаяВеличинаПроцентовНовая = 0;
		ПредельнаяСтавкаКредитованияГодНовая = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьНаСервере()
	МенеджерЗаписи = РегистрыСведений.ЛБ_ПредельныеЗначенияПроцентов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.ПредельнаяВеличинаПроцентов = ПредельнаяВеличинаПроцентовНовая;
    МенеджерЗаписи.ПредельнаяСтавкаКредитованияГод = ПредельнаяСтавкаКредитованияГодНовая;
	
    МенеджерЗаписи.Записать();  
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если Дата = Дата(1,1,1) Тогда
	    Сообщить("Не выбрана дата установки новых значений.");
		Возврат;
	ИначеЕсли ПредельнаяВеличинаПроцентовНовая = 0 И ПредельнаяСтавкаКредитованияГодНовая = 0 Тогда 
		Сообщить("Не выбраны значения для установки");
		Возврат;
	КонецЕсли;	 
	
	УстановитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПолучитьЗначенияНаДату();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
